Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabDbSwapOut Property
 Fabrication Database reload could not swap out for newer parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabDbSwapOut { get; }
Visual Basic
Public Shared ReadOnly Property FabDbSwapOut As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabDbSwapOut {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace